"MLH.V1"
"MLH.V7"
"1"
"post_2253851"
"Am taking medications for depression and anxiety, and experiencing some memoryissues coincident w/disorders or meds.    The memory problem: I can attend and event, a lecture, and the like.    Be quite focused, attentive, understanding, but afterword can remember little more than what subject matter was covered.    Too, experiences during the day, when recollected, seem discrete and unconnected - i.e., can't quite recall when such and such happened or whether it was today or yesterday.    I some- what overstate, but still it's all in all somewhat spooky. My psychiatrist has ordered an MRI brain scan and a memory workup w/a neurologist.    What might they be looking for?    I'm 70 yrs. old, no other memory problems, no other health issues."
"2"
"post_2151949"
"Hello,My mother had an incident yesterday where she lost her memory for an hour.    She doesnt remember what happened but she was walking around and scared and confused.    She knew at the time she needed to call for help and called my father but she cannot remember calling him.    An hour later my father came to pick her up and she recognized him and started to feel normal again.     What do you think caused her memory loss?"
"3"
"post_2292345"
"At age 53,my now 69 yr old husband had surgery for a benign brain tumor located between the the two frontal lobes of the brain requireing Laser Surgery. At that time he was told because of the heat generated in getting all of the tumor, he might at some later date, have some memory loss.    He has continued to work but in the last two years has noticed problems with memory. The work he    does    /did is detailed and requires concentration and memory. More recently, when in a stressful situation (not job related ) he became confused,unable to get facts straight/sorted out.    He also has a hard time making decisions.    He was abt. this same time    diagnosed with Chronic HBP and is on Lisinopril which is controlling it and seems to be helping. Fearing a return of the Tumor we consulted his Surgeon, had an EEG done, saw a top    Neurologist in our area, were prescribed Ativan &    Resperdal by two different doctors, neither of which he could tolerate. In fact he felt the Resperdal made things worse. From what the Drs. told us , at this time there is no sign of Tumor or Seizures or- they say- Dementia/Alzheimers.Could this spell of confusion have been a TIA ?    About    20 years ago, he had a spell of temporary l loss of sight in one eye, and tests showed his BP extremely high at that time. He was given a shot and sent home. The next day the Dr. told me \" I thought he was going to have a Stroke right in the office \". He tried meds to control it at that time but could not tolerate the meds.In all of these Dr. appts, he was never given a complete Physical Exam, nor were any tests done to check for blockage in arteries etc. Lab work ruled out Hypoglycemia ..He was told that HBP of long standing could affect memory.I guess my question is--just because Dementia was not found now, does that mean it will not show up in the near future.    From reading I've done it seems that heat generated by Lasix may \" seal off \" the brain cells causing problems ???Since we did not recieve any answers defineing the problem, I would appreciate your comments.thanks,    Junie 37"
"4"
"post_2276735"
"My 78 year old Dad visited a neurologist who suggested we have an EEG and an MRI performed.    She listed his condition as \"memory loss and slowness in thinking\".    What will we learn from the EEG and MRI as it relates to Dad's condition?    And from whatever we learn, what are the possible treatments?She also recommended we investigate Ariceipt and Razadyne. Why reasons are there not to proceed with the med treatment without the tests?I don't understand the 'value-add' of the tests if the treatment will be the same.Thanks in advance for your perspective.I"
"5"
"post_5328146"
"Every place I look it is all about Altzeimers. I do not think I have early Altzeimers. I do not know. I have been hit many times in the head. The last time was about four years ago. It felt as if my brain moved. It felt as if it slooshed into the back of my skull. Since then I have been experiencing problems with my memory and retention. More than usual. And I am now starting to have problems with remembering simple words. I will try to say something like \" where is their house?\" and will not remember the word house. It can take minutes of me stumbling and grasping through my mind before I can remember. Even though it is a common word. Can the being hit all my life & memory issues be related? Or is it because I am older (almost 40)? Or is it something else?"
"6"
"post_8287466"
"My father is aged 75 years. He was having problem in walking since February, 2012 but no other abnormality was there. A neurologist was consulted, who after CT Scan of brain, diagnosed Deep White matter brain Ischemia, Cerebral Atrophy and Parkinsonsism. Syndopa 110 (half tablets thrice daily), Tremnil 2 (half tablets thrice daily)    is being administered. But the condition goes on deteriorating instead of improvement. He cannot talk,walk or think properly. These symptoms were not there in the month of February, 2012. All these symptoms have developed after the administration of drugs. Recently Somazina Plus (Citicholine 500mg + Neurocetam 800 mg) is being administered. But no appreciable improvements are noticed.Kindly advise."
"7"
"post_8273191"
"hello. everyone, Im shay... very hard working mother of a 3 yr old. ad i work full time at a rehab center. i have been forgetting simple things. short term memory lose. lasting for about 6months now. im only twenty four. last night i for got whee i put a lit ciggerate. lol, im loosing my mind. I have been putting my keysin the sme place for three years now. THEY HANG ON THE WALL! i was searching everywhere. what do u think sounds like. y do i forget soo much"
"8"
"post_8271468"
"Im hoping someone can help me for the last 2 months I have watched my 78 yr old Mother go from a productive self sufficient woman..... That has had some forgetfulness and mild hallucinations to a women that can no longer dress her self or complete a sentence, We took her to neurologist and he did some testing in office that day.... Said she had some Dementia going on and started her on lowest dose Exelon patch with in 6 days she was paranoid and begging to go home ( she was home ) to go thru cabinets and gathering things to episodes of agitation ... We called Doc he sent us to Geriatric Pysch Doc that thought my Mom should be placed into Geriatric Pysch ward and be evaluated for Dementia , I told then my Mom' s rapid decline since starting exelon and short dose of Risperdone for Pyschoctic episodes..... She did 11 days in GeriPysch they add Zyprexa to the mix and within 4 days she was grabbing stuff out of the air that wasn't there having trouble using the right words and aggressive behavior.... She was taken to Nursing home and they said that they would take her off everything and let her dry out see what the behavior was like off all meds.... The only thing they D/C was the Exelon Patch they kept the Zyprexa and add seroquel .25 mg twice a day..... Now she doesn't know who we are half the time she can't sit still can't complete a sentence of more than 5 words that make no sense ..... She went from memory loss and confusion and some hallucinations to someone that looks like end stage Demenia .... Can this happen in less than 2 months????? We are fighting to get her off Anti- Pysch meds since the decline is even more rapid .....please help !!!! Don't know what to do...."
"9"
"post_8245436"
"Yes just wondering if anyone has the same concern I have or know of someone who does where spoken instructions or questions are very difficult to understand or retain memory of. However verbal instructions or writing information a person who requests it (such as a doctor) is relatively unimpaired. I am following up with a neurologist and psychiatrist and the diagnosis and treatment are clinically complex. However was interested in how this can be managed on a daily basis with some pragmatic ideas or suggestions."
"10"
"post_8243266"
"If this forum is no longer active, they should maybe prevent people from posting questions. ;)"
"11"
"post_8229151"
"Hi! I am in the process of having more tests done, but it seems my docs don't even know which direction to LOOK. One doc gave me 10 different \"guesses\" as to what she thought the cause of my memory loss/confusion is.    I am a 35yr old female, w/ history of migraine w/ aura & several episodes of \"complicated migraine\". 2-3 months ago, I had an episode that they can only assume was a complicated migraine (MRI & EEGs were normal). The severity of the episode improved over 24-48hrs (I had gotten lost while driving around, in a familiar place, couldn't remember how to use my phone to get help, & was confused by everything...signs, words, conversations, etc)...except some memory loss & confusion. I have a hard time with timelines, what seems like happened 2-3 wks ago, I am told happened only a day ago. I can only remember bits & pieces of things, & what I DO remember, seems like it happened several weeks ago (like trying to recall a dream that you only vaguely remember). My thoughts get \"jumbled up\" & I don't know what's what sometimes (makes me wonder if it's an actual complicated migraine when that happens). But I don't know if complicated migraines can leave you with ongoing memory loss & confusion like this. I can't \"hold on\" to information for more than a few seconds before I have to get the info again. I usually can't recall the things I've done earlier in the day...like my brain is just not making a memory of it.The neurologist I saw after my ER visit told me it could be a vitamin B-12 deficiency (and advised I started taking a B-complex vitamin...which I have been taking every day since then), she also suggested it could be hypothryoidism (which my mom has, & my tests last year were normal...but I plan to ask for a re-test), she also suggested a sleep disorder (but I've had trouble falling asleep since I was a kid, & nothing has changed). My doc is on the verge of calling this an early-onset form of dementia... I am even exploring psychiatric causes (schizophrenia) but I have no family history of that. I just want to know which direction to go in, & hope that it's something that can be TREATED.I know you can't diagnose on here, I was just hoping for some insight & medical opinions on what possibilities can cause this, b/c right now my docs seems stumped (and so do I), & I haven't yet seen the 2nd neuro (who I hope doesn't play pin-the-tail-on-the-patient w/ her diagnoses like the last one). :)Thank you for ANY insight/opinions you can share!~Kim"
"12"
"post_8719051"
"Firstly, thank you for taking the time to read this√¢ Ä ¶even if you don√¢ Ä ôt reply, maybe it will help you in some way !Background:Current medications:Lithiumsynthroidlexaprowellbutrinlamotriginenuvigil47yr old femaleBipolar-major depressiveSleep ApneaNarcolepsyLow thyroidHad multiple rounds of Electro Convulsive Therapy done in 2001--lost HUGE chunks of long term memory that never came backIncreasing difficulty with short term memoryDouble vision (worse when lying sideways & close vision)On and off swallowing/throat problems (last sev weeks & then disappears..have had about 30 or so incidents,drs. never able to figure out why)tremors (worse in morning-mainly shows in hands..sometimes head)Continual constipationno energy..fatigue especially in last few yearsPainful, sudden spikes of pain in toes(once or twice a day)Continual soreness & stiffness all over body,,oftn very difficult & painful to get out of bed in the morning (have to hold on to furniture to gain balance and lean on for support)Had pretty extensive bloodwork done in August..incl B12..all okHave always experienced moderate twitching while falling asleep..recently severe jerking..even during the daytime..even whole upper body, head, legs/feet (twice while driving) even my stomach !!Just experencied six months of continual numbness & tingling of left side arm/hand..sometimes stomach/foot/leg & head cervical MRI, shows increasing degeneration, but nothing to point to the reason for the recent numbness/tingling/painEEG showed nerve entrapment in elbow with incredibly sensitive reflexes on entire boy/was referred to surgeon/he immediately ordered cervical x-ray/then sent me back to my cervical surgeon who ordered a cervical mri..have been some changes but nothing incredibly dramaticAfter six months, all numbness suddenly goneHave had 2 brain MRI√¢ Ä ôs (none since short term memory worsening)One brain MRI before a cervical fusion surgery (2006)Another in 2007 when experiencing decreasing sensation in face, arm    & legDon√¢ Ä ôt have a copy of 2006 MRI2007 MRI (which I think is fairly normal???) shows:several FLAIR punctate hyperintensities in the occipital lobes bilaterally, unchanged from previous exam...no lesions, masses, etc., normal vascular flows..some motion degradation.IMPRESSION: Findings consistent with chronic small vessselischemic changes in white matter tracts in the occipital lobes bilaterally.In Nov of 2011, I had an eye injury..totally extended bungy cord snapped back to catch me in the right eye√¢ Ä ¶was bleeding internally in eye..given 1 week bed rest & medication (steroids?) Still have continual √¢ Ä úfloaters√¢ Ä ù--black lines.SIDE NOTES:My friends and family normally make remarks about my lack of memory abilityMy 76yr old father..just recently had a very significant stroke-related to the caratoid)    also have family history of Parkinson√¢ Ä ôs.. paternal grandfather & fatherHave started a journal recently as I and my husband are noticing some puzzling events:Memory journal~ 12/1 taking call at work w/trainee listening in (have done several times before√¢ Ä ¶. ..my mind went totally blank for about 5 seconds..could not remember what I was saying or thinking~ 1/1/13 could not remember how to fold a tshirt..took about 3-4 seconds to recall~    1/7/13 could not remember how to switch from cd to radio in my car (I spend 3 hrs a DAY in my car commuting)1/8/13 could not find my car in the parking garage..I park there every morning..not always on the same level..I spent 45min looking for it before going to the security office where they found that my parking pass had NOT been used that day to exit the garage..eventually (after about 20 more min of walking found it)1/9/13 carried a bottle of water (among other things) up the steps...laid everything on the bed and then asked my husband to bring my bottle of water upstairs1/10/13 brushing teeth...toothpaste in top right drawer for (approx 6 months.. we just moved) open cabinet above & to the right of the sink...looking for the toothpaste..took about 1 sec until I had realized what i had doneAt least 2-3 times a day while walking around, forget the task at handThank you so much for taking the time and the energy to read thru this√¢ Ä ¶any and all comments would be appreciated√¢ Ä ¶even a √¢ Ä úyou√¢ Ä ôre OK, you√¢ Ä ôre just getting older√¢ Ä ù    :o)Thanks !Jennifer ."
"13"
"post_8764925"
"i've been diagnosed with TBI, and during the day i seem to lose my short term memory and keep forgetting stuff, i have schizophrenia and when i stop to listen to the voices i will become distracted and forgetful what can i do ?"
"14"
"post_8296587"
"I am    having considerable amount of memory loss .    My MRI of brain came with an impression'early diffuse cortical atrophy' also in the report ' note made of rightward deviation of septum pellucidum at anterior aspect? Significance.    I have been given memanine hcl & alpha glycerylphosphorylcholine piracetam tab please advise abt my condition does it mean I am having dementia how can I fight with it I am a 45-year-old male from india"
"15"
"post_8724088"
"Firstly, thank you for taking the time to read this√¢ Ä ¶even if you don√¢ Ä ôt reply, maybe it will help you in some way !This is long but I wanted the complete picture to be shown.Background:Current medications:Lithiumsynthroidlexaprowellbutrinlamotriginenuvigil47yr old femaleBipolar-major depressive under control since 2003 w/ one minor depressive event sinceSleep ApneaNarcolepsyLow thyroidHad multiple rounds of Electro Convulsive Therapy done in 2001--lost HUGE chunks of long term memory that never came backIncreasing difficulty with short term memoryDouble vision (worse when lying sideways & close vision)On and off swallowing/throat problems (last sev weeks & then disappears..have had about 30 or so incidents,drs. never able to figure out why)tremors (worse in morning-mainly shows in hands..sometimes head)Continual constipationno energy..fatigue especially in last few yearsPainful, sudden spikes of pain in toes(once or twice a day)Continual soreness & stiffness all over body,,oftn very difficult & painful to get out of bed in the morning (have to hold on to furniture to gain balance and lean on for support)Had pretty extensive bloodwork done in August..incl B12..all okHave always experienced moderate twitching while falling asleep..recently severe jerking..even during the daytime..even whole upper body, head, legs/feet (twice while driving) even my stomach !!Just experencied six months of continual numbness & tingling of left side arm/hand..sometimes stomach/foot/leg & head cervical MRI, shows increasing degeneration, but nothing to point to the reason for the recent numbness/tingling/painEEG showed nerve entrapment in elbow with incredibly sensitive reflexes on entire boy/was referred to surgeon/he immediately ordered cervical x-ray/then sent me back to my cervical surgeon who ordered a cervical mri..have been some changes but nothing incredibly dramaticAfter six months, all numbness suddenly goneHave had 2 brain MRI√¢ Ä ôs (none since short term memory worsening)One brain MRI before a cervical fusion surgery (2006)Another in 2007 when experiencing decreasing sensation in face, arm    & legDon√¢ Ä ôt have a copy of 2006 MRI2007 MRI (which I think is fairly normal???) shows:several FLAIR punctate hyperintensities in the occipital lobes bilaterally, unchanged from previous exam...no lesions, masses, etc., normal vascular flows..some motion degradation.IMPRESSION: Findings consistent with chronic small vessselischemic changes in white matter tracts in the occipital lobes bilaterally.In Nov of 2011, I had an eye injury..totally extended bungy cord snapped back to catch me in the right eye√¢ Ä ¶was bleeding internally in eye..given 1 week bed rest & medication (steroids?) Still have continual √¢ Ä úfloaters√¢ Ä ù--black lines.SIDE NOTES:My friends and family normally make remarks about my lack of memory abilityMy 76yr old father..just recently had a very significant stroke-related to the caratoid)    also have family history of Parkinson√¢ Ä ôs.. paternal grandfather & fatherHave started a journal recently as I and my husband are noticing some puzzling events:Memory journal~ 12/1 taking call at work w/trainee listening in (have done several times before√¢ Ä ¶. ..my mind went totally blank for about 5 seconds..could not remember what I was saying or thinking~ 1/1/13 could not remember how to fold a tshirt..took about 3-4 seconds to recall~    1/7/13 could not remember how to switch from cd to radio in my car (I spend 3 hrs a DAY in my car commuting)1/8/13 could not find my car in the parking garage..I park there every morning..not always on the same level..I spent 45min looking for it before going to the security office where they found that my parking pass had NOT been used that day to exit the garage..eventually (after about 20 more min of walking found it)1/9/13 carried a bottle of water (among other things) up the steps...laid everything on the bed and then asked my husband to bring my bottle of water upstairs1/10/13 brushing teeth...toothpaste in top right drawer for (approx 6 months.. we just moved) open cabinet above & to the right of the sink...looking for the toothpaste..took about 1 sec until I had realized what i had done1/11/13 took me about 3 seconds to remember the word for shoulderAt least 2-3 times a day while walking around, forget the task at handOften..on a much traveled route..find myself reaching the destination & thinking √¢ Ä úwow√¢ Ä ¶I really got here quickly√¢ Ä ù and then realize that I don√¢ Ä ôt remember a large portion of the driveThank you so much for taking the time and the energy to read thru this√¢ Ä ¶any and all comments would be appreciated√¢ Ä ¶even a √¢ Ä úyou√¢ Ä ôre OK, you√¢ Ä ôre just getting older√¢ Ä ù    :o)Thanks !Jennifer"
"16"
"post_8484528"
"HiI'm very worried about my girlfriend. She occasionally forgets words (she notices this) and also mixes words up - he/she - knife/fork. I should point out that English is not her first language, but she tells me she sometimes forgets words in polish too, and she never used to do this before.Recently she seems to forget things, like her phone or keys.She has been to the doctor and scored perfectly on the cognitive test - Count backwards from 100 by deducting 7 - Remember these three items - What is the date? -    Those kind of things.The doctor has ordered blood tests (Thyroid - blood count - liver function - and some others) But we haven't had the results yet.She has recently started a new business (investing her own money) and I know that this is a stress on her. Although she never acts stressed or tells me she feels stressed.Has anyone gone through anything similar?Thanks,Paul"
"17"
"post_8607046"
"I have had many symptoms but my most recent that are really concerning me are I can not remember daily events even things I did yesterday, back pain, pain in left jaw, numbness/pain in left arm, coughing up phlegm for a month, difficulty with coordination, dizzy, cannot get in deep sleep when I wake up don't feel tired or anything feels like I never fell asleepI have had an MRI of the brain 4 months ago and an EKG, Bloodwork, and chest X-ray one month ago (before phlegm coughing)Symptoms for past 6 months:Pain in back left and right sidePain in head but not headache it's little spurts √Ç  of pain in different areasThoughts won't make senseSometimes have a very difficult time communicating my thoughts, I use to be really good at socializing √Ç  and speaking to people, now I find it hard to verbalize my opinions or thoughts... Feels like a stutter but not in speech in my thoughtsReally hard remembering daily events"
"18"
"post_8635256"
"i was forgetting things, like pans on the stove, and had 3 kitchen fires in a month. Also several fall. My last fall I hit the side of my head in the house.    the CT scan at the hospital showed i had expierenced a stroke in the pons area sometime after 2008 ( last film and this was not there then). I am very worried.    I have to have an MRI next.    I am scared .    so what does all this mean?    can't I restroke again, and soon?    send me your opinion.actual words on ct scan were...lacunar infarct.thank you NJE"
"19"
"post_8530384"
"Hay guys I have a few thing I need some help with for the last 2 years I have been getting some short sharp stabing pains around my head about 6 weeks ago I went to my go and wanted an MRI done on my head to check for a tumor but my go said its not a tumor as I wildest have the sharp pains for this long without any other symptoms so I let it go then about a week laiter I started to have some memory loss it's not to bad more like brain fogI do suffer from panic attacks but have been only haveing them for the last year but I've had the head pains for longer I do not suffer from headaches that often just the normal headache free an there but I do have bad eye sight but my gp is saying that is not the cause but he doesn't wont to do any more test he is just saying it is strees and the panic attacks that is the cause can some one plz help me"
"20"
"post_8567357"
"I been having some usual headaches. I have headaches that start in my forehead and moves to the center, and back of my head. I've had an MRI and everything turn out find. At times I do have problems with my sinuses but not like this. Sometimes my neck hurts along with these headaches. My headaches feels like stabbing pain, or my head is burning and itchy which I find that it is weird. Sometimes i do feel a little nausea with it. Do any one have any idea what is wrong! I have headache just about everyday."
"21"
"post_8552128"
"Looking for possible causes and solutions. In 1989 neuro diag ms or pd. new pcp in 1990-2009 insisted nothing wrong. After second child 1999, pins n needles started in feet hands, progressed up entire legs. (was told just a pinched nerve) night sweats, primarily chest to neck off n on sine 1989. Pleurisy in 2000, vertigo off/on since 2001. Tremors. Extreme fatigue. 2010 2 lymphomas discovered, pulmonary. Successfully treated. Pins n needles turned to pure \"cut my legs off\" pain. Joints froze. Falling. Lost ability to comprehend reading. Can read short posts. Children books. Awaiting diagnosis from neuro. Have movement clinic appt, MRI, emg, tilt table (I faint/black out)    sugar and thyroid check. heat n cold intolerance. Urinary probs started this year.Advised to play video games, read 1st grade books and repeat/write what I read. Any other advice welcomed!"
"22"
"post_8514094"
"My significant other is a young male late 20's no serious medical issues. He recently had an episode where he lost complete knowledge of the world around him. Did not know who anyone was, where he was. Could not recall the month etc. He said he had a warm burning sensation in his head accompanied by a headache. After about 2 hours of going in and out of this state, he regained his full memory (but could not recall the memory lapse episode). His body showed signs of weakness up until about 8 hours after the incident. No specific side of the body, just lack of strength to stand up on his own and what seemed like motor impairment. My first thought was he had a stroke... is this possible? He did not show any signs of weakened facial muscles or an extended period of time with weakened limbs. There was no visible sign of the body experiencing any trauma immediately before the SUDDEN memory loss. Any thoughts? He does have some signs of PTSD from military past. Could this be related? He had been drinking that night but much less than usual."
"23"
"post_8439631"
"I am a 42 year male but these issues have been with me since very beginning...(i) Anomic aphasia (can't remember names and words when I want to)... (ii) Geospatial orientation disability (cannot orientate on directions unless have a map)....I am wondering if there is an underlying phenomenon that may explain these..."
"24"
"post_8473926"
"A week ago I blacked out while driving, I was not injured in the accident. But every since the black out I get very confused when I talk and I forget words, also my sight is very blurry and when I try to read I get really confused? I was in the hospital for 3 days, they did a bunch of tests but they didn't tell me anything. They just said they MRI and the echo looked OK. But I'm really starting to worry. I'm a 46 year old female."
"25"
"post_8451808"
"I'm a 51 year old male and have had fatigue, chronic forehead pressure, and mental fog for 30+ years. I'm otherwise in good health and exercise at least 6 days/week. I'm incredibly frustrated by this condition as it's cost me both personally and professionally.I'm highly allergic to a lot of grasses, trees, molds, etc. and have been through about 6 rounds of shots and drops since 1994 to no avail. Allergy retest each time I start a round back up have shown the same allergic response so it's apparent my body isn't building up an immunity. Also have had expensive food allergy test ($1000 skin prick and a $750 ALCAT blood test). Skin prick showed allergic response to all foods except pork and chocolate whereas the ALCAT showed intolerance to less foods. My symptoms have gotten more chronic over the last few years. I've also been to 2 neurologists, tried various antidepressants, had spinal tap, MRI's, botox injections, etc. etc. all to no avail.Note that I had sinus surgery 10 years ago and sinuses drain fine.Had a few questions:1. Do my symptoms sound like they are related to food intolerance (ie: sinus cavities) , facial nerve inflammation, or facial muscle tension?2. What clinic in the US is the best at treating environmental or food type allergies/intolerances? What about clinics for chronic pressure type symptoms and/or heachache?3. Could sinuses be the culprit even though I can breath fine and have no congestion? ie: inflamed lining that are able to drain properly."
"26"
"post_8425444"
"I have had memory loss for a long time now. I have gone through some trauma in my life, but I have never banged my head or been in a car accident. I have been emotionally abused and was in a bad controlling relationship 4 years ago. I am 21 years old, yet as soon as events happen I don't remember them unless I see pictures or hear someone recall a happy event. For example, they will say remember when? and then they will tell a story and I don't remember it until they explain. I don't remember my childhood. I know I don't have PTSD, but I know something is not right and I need answers. I have gone to a counselor, but no diagnosis as far as I know. I have 2 kids. They are 3 and 4 years old. I dont even remember what they looked like when they were little. I can't picture many things in my head when I close my eyes and try to remember things. Lately I have been looking at people, then close my eyes to see if I can picture what they look like but I can't. I know I don't have prosopagnosia. I have a hard time comprehending things when I read and I don't know if that has anything to do with my memory. I am a senior at a University, but I only remember my notes short term enough to take a test then I forget it all. I want to be able to recall memories of my childhood. I sit and think hard, but nothing comes to my mind. My thoughts    are always jumbled up. Everyone knows I don't have a good memory, but only my mom and I know to what degree. I am mentaly stable and live a normal life, only problem is my memory. I hope I don't sound crazy, but I hope someone on this blog can give me an idea of what the problem is."
"27"
"post_8423677"
"Hello everyone,I'm a 30 years old and for the last 2 months, I've been    suffer from tiredness and irritation.Even standing for too long is a problem, because I have this feeling of falling down always(I fell onceactually). Now, I have to think too much to remember even simple thinks.I recently suffered from Uninary track infection and received an infection of ceftriaxone (4 times), and some other antibiotics. The infection disappeared, but    I started feeling weak and tired right after the injection.My blood analysis revealed a sedimentation rate that was too high(+++), but the doctor did not prescribe any medicines.Other tests: HIV, Hepatitis, Diabetes were all negative.My Other symptoms include: Dry throat, dry hands and feats (But I take enough liquids) .Strange blue color appearing in small parts of my hands.Can you guys advice me what to do? What type of tests/doctor can I see for consultation?Thx,ECK."
"28"
"post_8408367"
"Hi,We are pleased to share with your community our Dementia Communityhttp://www.medhelp.org/forums/Dementia/show/1465Dementia is a descriptive term for a collection of symptoms that can be caused by a number of disorders that affect the brain. While memory loss is a common symptom of dementia, memory loss by itself does not mean that a person has dementia.Please stop by soon.Best,Cheryl"
"29"
"post_8341081"
"mymumiscurrenty unableo rememberthing.Whataream igoingtodo?"
"30"
"post_8293299"
"My MRI shows chronic ischemic foli in cerebral white matter.Mixed altered signal in pre central gyrus on right side.I forget afew things like names or why I have gone to a room.I am independent.my consultant neurologist says everything is ok.I did very well in cognitive memory assessment .I am still prescribed a tablet which I am to take for life.Please explain to me in simple words what this all means."
"31"
"post_8293388"
"I was working a very stressful, complicated, heavy multitasking job dealing with two customers at a time, each within 15 minutes apiece, for 15 years. After a couple of years, I started developing dyslexia (never had it before), and gradual loss of memory. I coped with it for the next twelve years since needed the paycheck but finally completely blanked out at work. I have been out of work for a year and a half due to having a functional IQ of around 50 or less (Had 141 IQ in the military). I can only do one task to completion without interruptions or have to start all over now. All physical testing has been negative. Every neurologist, psychologist, psychiatrist I have talked to refuse to diagnose or assist me with my problem. I wasn't noticibly depressed when I first blanked out but after having been refused assistance by numerous doctors, frustration and depression is now developing. Can anyone help with a diagnosis or point me in the right direction for help. I live in San Antonio. Thanks"
